pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR16DU14def.inc
; Event Generation 1 Select
.equ RTC_EVGEN1SEL_OFF_gc = (0x00<<4)    ; No Event Generated
.equ RTC_EVGEN1SEL_DIV4_gc = (0x01<<4)   ; CLK_RTC divided by 4
.equ RTC_EVGEN1SEL_DIV8_gc = (0x02<<4)   ; CLK_RTC divided by 8
.equ RTC_EVGEN1SEL_DIV16_gc = (0x03<<4)  ; CLK_RTC divided by 16
.equ RTC_EVGEN1SEL_DIV32_gc = (0x04<<4)  ; CLK_RTC divided by 32
.equ RTC_EVGEN1SEL_DIV64_gc = (0x05<<4)  ; CLK_RTC divided by 64
.equ RTC_EVGEN1SEL_DIV128_gc = (0x06<<4) ; CLK_RTC divided by 128
.equ RTC_EVGEN1SEL_DIV256_gc = (0x07<<4) ; CLK_RTC divided by 256
.equ RTC_EVGEN1SEL_DIV512_gc = (0x08<<4) ; CLK_RTC divided by 512
.equ RTC_EVGEN1SEL_DIV1024_gc = (0x09<<4) ; CLK_RTC divided by 1024
.equ RTC_EVGEN1SEL_DIV2048_gc = (0x0A<<4) ; CLK_RTC divided by 2048
.equ RTC_EVGEN1SEL_DIV4096_gc = (0x0B<<4) ; CLK_RTC divided by 4096
.equ RTC_EVGEN1SEL_DIV8192_gc = (0x0C<<4) ; CLK_RTC divided by 8192
.equ RTC_EVGEN1SEL_DIV16384_gc = (0x0D<<4) ; CLK_RTC divided by 16384
.equ RTC_EVGEN1SEL_DIV32768_gc = (0x0E<<4) ; CLK_RTC divided by 32768


;*************************************************************************
;** SIGROW - Signature row
;*************************************************************************

; SIGROW_TEMPSENSE0 masks
.equ SIGROW_TEMPSENSE0_gm = 0xFFFF       ; Temperature Calibration 0 group mask
.equ SIGROW_TEMPSENSE0_gp = 0            ; Temperature Calibration 0 group position
.equ SIGROW_TEMPSENSE0_0_bm = (1<<0)     ; Temperature Calibration 0 bit 0 mask
.equ SIGROW_TEMPSENSE0_0_bp = 0          ; Temperature Calibration 0 bit 0 position
.equ SIGROW_TEMPSENSE0_1_bm = (1<<1)     ; Temperature Calibration 0 bit 1 mask
.equ SIGROW_TEMPSENSE0_1_bp = 1          ; Temperature Calibration 0 bit 1 position
.equ SIGROW_TEMPSENSE0_2_bm = (1<<2)     ; Temperature Calibration 0 bit 2 mask
.equ SIGROW_TEMPSENSE0_2_bp = 2          ; Temperature Calibration 0 bit 2 position
.equ SIGROW_TEMPSENSE0_3_bm = (1<<3)     ; Temperature Calibration 0 bit 3 mask
.equ SIGROW_TEMPSENSE0_3_bp = 3          ; Temperature Calibration 0 bit 3 position
.equ SIGROW_TEMPSENSE0_4_bm = (1<<4)     ; Temperature Calibration 0 bit 4 mask
.equ SIGROW_TEMPSENSE0_4_bp = 4          ; Temperature Calibration 0 bit 4 position
.equ SIGROW_TEMPSENSE0_5_bm = (1<<5)     ; Temperature Calibration 0 bit 5 mask
.equ SIGROW_TEMPSENSE0_5_bp = 5          ; Temperature Calibration 0 bit 5 position
.equ SIGROW_TEMPSENSE0_6_bm = (1<<6)     ; Temperature Calibration 0 bit 6 mask
.equ SIGROW_TEMPSENSE0_6_bp = 6          ; Temperature Calibration 0 bit 6 position
.equ SIGROW_TEMPSENSE0_7_bm = (1<<7)     ; Temperature Calibration 0 bit 7 mask
.equ SIGROW_TEMPSENSE0_7_bp = 7          ; Temperature Calibration 0 bit 7 position
.equ SIGROW_TEMPSENSE0_8_bm = (1<<8)     ; Temperature Calibration 0 bit 8 mask
.equ SIGROW_TEMPSENSE0_8_bp = 8          ; Temperature Calibration 0 bit 8 position
.equ SIGROW_TEMPSENSE0_9_bm = (1<<9)     ; Temperature Calibration 0 bit 9 mask
.equ SIGROW_TEMPSENSE0_9_bp = 9          ; Temperature Calibration 0 bit 9 position
.equ SIGROW_TEMPSENSE0_10_bm = (1<<10)   ; Temperature Calibration 0 bit 10 mask
.equ SIGROW_TEMPSENSE0_10_bp = 10        ; Temperature Calibration 0 bit 10 position
.equ SIGROW_TEMPSENSE0_11_bm = (1<<11)   ; Temperature Calibration 0 bit 11 mask
.equ SIGROW_TEMPSENSE0_11_bp = 11        ; Temperature Calibration 0 bit 11 position
.equ SIGROW_TEMPSENSE0_12_bm = (1<<12)   ; Temperature Calibration 0 bit 12 mask
.equ SIGROW_TEMPSENSE0_12_bp = 12        ; Temperature Calibration 0 bit 12 position
.equ SIGROW_TEMPSENSE0_13_bm = (1<<13)   ; Temperature Calibration 0 bit 13 mask
.equ SIGROW_TEMPSENSE0_13_bp = 13        ; Temperature Calibration 0 bit 13 position
.equ SIGROW_TEMPSENSE0_14_bm = (1<<14)   ; Temperature Calibration 0 bit 14 mask
.equ SIGROW_TEMPSENSE0_14_bp = 14        ; Temperature Calibration 0 bit 14 position
.equ SIGROW_TEMPSENSE0_15_bm = (1<<15)   ; Temperature Calibration 0 bit 15 mask
.equ SIGROW_TEMPSENSE0_15_bp = 15        ; Temperature Calibration 0 bit 15 position

; SIGROW_TEMPSENSE1 masks
.equ SIGROW_TEMPSENSE1_gm = 0xFFFF       ; Temperature Calibration 1 group mask
.equ SIGROW_TEMPSENSE1_gp = 0            ; Temperature Calibration 1 group position
.equ SIGROW_TEMPSENSE1_0_bm = (1<<0)     ; Temperature Calibration 1 bit 0 mask
.equ SIGROW_TEMPSENSE1_0_bp = 0          ; Temperature Calibration 1 bit 0 position
.equ SIGROW_TEMPSENSE1_1_bm = (1<<1)     ; Temperature Calibration 1 bit 1 mask
.equ SIGROW_TEMPSENSE1_1_bp = 1          ; Temperature Calibration 1 bit 1 position
.equ SIGROW_TEMPSENSE1_2_bm = (1<<2)     ; Temperature Calibration 1 bit 2 mask
.equ SIGROW_TEMPSENSE1_2_bp = 2          ; Temperature Calibration 1 bit 2 position
.equ SIGROW_TEMPSENSE1_3_bm = (1<<3)     ; Temperature Calibration 1 bit 3 mask
.equ SIGROW_TEMPSENSE1_3_bp = 3          ; Temperature Calibration 1 bit 3 position
.equ SIGROW_TEMPSENSE1_4_bm = (1<<4)     ; Temperature Calibration 1 bit 4 mask
.equ SIGROW_TEMPSENSE1_4_bp = 4          ; Temperature Calibration 1 bit 4 position
.equ SIGROW_TEMPSENSE1_5_bm = (1<<5)     ; Temperature Calibration 1 bit 5 mask
.equ SIGROW_TEMPSENSE1_5_bp = 5          ; Temperature Calibration 1 bit 5 position
.equ SIGROW_TEMPSENSE1_6_bm = (1<<6)     ; Temperature Calibration 1 bit 6 mask
.equ SIGROW_TEMPSENSE1_6_bp = 6          ; Temperature Calibration 1 bit 6 position
.equ SIGROW_TEMPSENSE1_7_bm = (1<<7)     ; Temperature Calibration 1 bit 7 mask
.equ SIGROW_TEMPSENSE1_7_bp = 7          ; Temperature Calibration 1 bit 7 position
.equ SIGROW_TEMPSENSE1_8_bm = (1<<8)     ; Temperature Calibration 1 bit 8 mask
.equ SIGROW_TEMPSENSE1_8_bp = 8          ; Temperature Calibration 1 bit 8 position
.equ SIGROW_TEMPSENSE1_9_bm = (1<<9)     ; Temperature Calibration 1 bit 9 mask
.equ SIGROW_TEMPSENSE1_9_bp = 9          ; Temperature Calibration 1 bit 9 position
.equ SIGROW_TEMPSENSE1_10_bm = (1<<10)   ; Temperature Calibration 1 bit 10 mask
.equ SIGROW_TEMPSENSE1_10_bp = 10        ; Temperature Calibration 1 bit 10 position
.equ SIGROW_TEMPSENSE1_11_bm = (1<<11)   ; Temperature Calibration 1 bit 11 mask
.equ SIGROW_TEMPSENSE1_11_bp = 11        ; Temperature Calibration 1 bit 11 position
.equ SIGROW_TEMPSENSE1_12_bm = (1<<12)   ; Temperature Calibration 1 bit 12 mask
.equ SIGROW_TEMPSENSE1_12_bp = 12        ; Temperature Calibration 1 bit 12 position
.equ SIGROW_TEMPSENSE1_13_bm = (1<<13)   ; Temperature Calibration 1 bit 13 mask
.equ SIGROW_TEMPSENSE1_13_bp = 13        ; Temperature Calibration 1 bit 13 position
.equ SIGROW_TEMPSENSE1_14_bm = (1<<14)   ; Temperature Calibration 1 bit 14 mask
.equ SIGROW_TEMPSENSE1_14_bp = 14        ; Temperature Calibration 1 bit 14 position
.equ SIGROW_TEMPSENSE1_15_bm = (1<<15)   ; Temperature Calibration 1 bit 15 mask
.equ SIGROW_TEMPSENSE1_15_bp = 15        ; Temperature Calibration 1 bit 15 position


;*************************************************************************
;** SLPCTRL - Sleep Controller
;*************************************************************************

; SLPCTRL_CTRLA masks
.equ SLPCTRL_SEN_bm = 0x01               ; Sleep enable bit mask
.equ SLPCTRL_SEN_bp = 0                  ; Sleep enable bit position
.equ SLPCTRL_SMODE_gm = 0x06             ; Sleep mode group mask
.equ SLPCTRL_SMODE_gp = 1                ; Sleep mode group position
.equ SLPCTRL_SMODE_0_bm = (1<<1)         ; Sleep mode bit 0 mask
.equ SLPCTRL_SMODE_0_bp = 1              ; Sleep mode bit 0 position
.equ SLPCTRL_SMODE_1_bm = (1<<2)         ; Sleep mode bit 1 mask
.equ SLPCTRL_SMODE_1_bp = 2              ; Sleep mode bit 1 position

; SLPCTRL_VREGCTRL masks
.equ SLPCTRL_PMODE_gm = 0x07             ; Performance Mode group mask
.equ SLPCTRL_PMODE_gp = 0                ; Performance Mode group position
.equ SLPCTRL_PMODE_0_bm = (1<<0)         ; Performance Mode bit 0 mask
.equ SLPCTRL_PMODE_0_bp = 0              ; Performance Mode bit 0 position
.equ SLPCTRL_PMODE_1_bm = (1<<1)         ; Performance Mode bit 1 mask
.equ SLPCTRL_PMODE_1_bp = 1              ; Performance Mode bit 1 position
.equ SLPCTRL_PMODE_2_bm = (1<<2)         ; Performance Mode bit 2 mask
.equ SLPCTRL_PMODE_2_bp = 2              ; Performance Mode bit 2 position
.equ SLPCTRL_HTLLEN_bm = 0x10            ; High Temperature Low Leakage Enable bit mask
.equ SLPCTRL_HTLLEN_bp = 4               ; High Temperature Low Leakage Enable bit position

; Sleep mode select
.equ SLPCTRL_SMODE_IDLE_gc = (0x00<<1)   ; Idle mode
.equ SLPCTRL_SMODE_STDBY_gc = (0x01<<1)  ; Standby Mode
.equ SLPCTRL_SMODE_PDOWN_gc = (0x02<<1)  ; Power-down Mode

; High Temperature Low Leakage Enable select
.equ SLPCTRL_HTLLEN_OFF_gc = (0x00<<4)   ; Disabled
.equ SLPCTRL_HTLLEN_ON_gc = (0x01<<4)    ; Enabled

